pax-zhang/ai-passport/sdkconfig.defaults
# --- 目标芯片 ---
CONFIG_IDF_TARGET="esp32c3"
# 注:ESP32-C3 无 PSRAM,故不设 CONFIG_SPIRAM。

# --- Flash ---
# FoloToy AI Passport 的所有硬件批次均使用 8MB Flash。
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
# 烧录时按实际探测容量回写镜像头。
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=y

# --- 控制台:USB-Serial-JTAG(C3 原生 USB,GPIO18/19)---
# 不用 UART0:其默认 TX=GPIO21 与本板背光引脚冲突。
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# --- LVGL ---
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
# 像素风 UI 不要 Material 过渡:默认 theme 的白底卡片 + 80ms 插值会闪白。
CONFIG_LV_THEME_DEFAULT_TRANSITION_TIME=0
CONFIG_LV_THEME_DEFAULT_GROW=n
# LVGL 内置 malloc 池大小(KB)。它是独立静态区、不与系统堆共享,配大了会白白占用 RAM。
# 24KB 够 header + 列表 + 通知/锁屏浮层;32KB 会从系统堆再拿走 8KB,天气 DNS 容易碎掉。
CONFIG_LV_MEM_SIZE_KILOBYTES=26

# --- 系统 ---
# tickless idle 会在浅睡时停掉 tick。1000Hz 只影响唤醒后的调度粒度,
# 让 IDLE_TIME_BEFORE_SLEEP=3 变成 3ms,BLE 连接事件之间才进得去浅睡。
CONFIG_FREERTOS_HZ=1000
CONFIG_PM_ENABLE=y
CONFIG_PM_DFS_INIT_AUTO=n
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
CONFIG_FREERTOS_IDLE_TIME_BEFORE_SLEEP=3
CONFIG_ESP_PHY_MAC_BB_PD=y
# 开机要在主任务里建主页并排 CJK 字形,默认 3584 会溢出导致黑屏复位。
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
# 按键回调跑在 esp_timer 任务;切语言/刷中文标签需要比默认更大的栈。
CONFIG_ESP_TIMER_TASK_STACK_SIZE=8192
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

# --- WiFi:APSTA,开机热点配网;缓冲仍按无 PSRAM 收紧 ---
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y
CONFIG_ESP_WIFI_SOFTAP_BEACON_MAX_LEN=256
CONFIG_ESP_WIFI_SOFTAP_SAE_SUPPORT=n
# 默认 10/32/32 静态+动态缓冲对无 PSRAM 的 C3 过肥;STA 天气预报 + 偶发 httpd 够用。
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=4
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=6
CONFIG_ESP_WIFI_RX_BA_WIN=4
CONFIG_ESP_WIFI_TX_BA_WIN=4
CONFIG_ESP_WIFI_MGMT_SBUF_NUM=16

# --- 表盘固件不启用蓝牙 ---
# CONFIG_BT_ENABLED is not set

# OTA 清单和镜像走 HTTPS 客户端。常用根证比全量 bundle 小。
CONFIG_MBEDTLS_TLS_SERVER_ONLY=n
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=n
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_CMN=y
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
# STA + httpd:80 热点认证页/扫码。每个 httpd 另占 3 个内部套接字。
CONFIG_LWIP_MAX_SOCKETS=10
CONFIG_LWIP_MAX_ACTIVE_TCP=6
CONFIG_LWIP_MAX_LISTENING_TCP=4
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=12
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=2880
CONFIG_LWIP_TCP_WND_DEFAULT=2880
# 天气/网页都走 IPv4;关掉 IPv6 可收回 nd6 和控制块。
CONFIG_LWIP_IPV6=n

# --- 分区:8MB Flash,双 OTA 各约 3.9MB。默认 1MB 装不下 Wi-Fi STA ---
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
